# String cleaning

In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv(r"C:\Users\Ramya\OneDrive\Documents\dataset\data.csv")
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,95
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97
2,J.Ramya,AIR,A,52,jivvireddyramyasri@gmailcom,9676976652,90
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90
6,Y.Kaveri,AIR,A,3,yendamurikaveri@gmail.com,7386015549,94
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,93

In [4]:
df["NAME"]=df["NAME"].str.lower()
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,b.yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,95
1,p.devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97
2,j.ramya,AIR,A,52,jivvireddyramyasri@gmailcom,9676976652,90
3,k.prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85
4,k.v. niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96
5,k.sri niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90
6,y.kaveri,AIR,A,3,yendamurikaveri@gmail.com,7386015549,94
7,p.durga,AIR,A,24,durgarani@gmail.com,8466845651,89
8,p.akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90
9,p.neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,93

# concate Data Frames

In [5]:
us_weather=pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "Temperature":[32,45,35]
})
us_weather

       city  Temperature
0  new york           32
1   chicago           45
2   orlando           35

In [6]:
india_weather=pd.DataFrame({
    "city":["mumbai","ap","banglore"],
    "Temperature":[33,44,35]
})
india_weather

       city  Temperature
0    mumbai           33
1        ap           44
2  banglore           35

In [7]:
df=pd.concat([india_weather,us_weather])
df

       city  Temperature
0    mumbai           33
1        ap           44
2  banglore           35
0  new york           32
1   chicago           45
2   orlando           35

In [8]:
df=pd.concat([india_weather,us_weather],axis=1)
df

       city  Temperature      city  Temperature
0    mumbai           33  new york           32
1        ap           44   chicago           45
2  banglore           35   orlando           35

# merge data frames

In [9]:
temp_df=pd.DataFrame({
    "city":["hyderabad","bangalore","vishakapatnam","chennai"],
    "Temperature":[32,45,30,35]
})
temp_df

            city  Temperature
0      hyderabad           32
1      bangalore           45
2  vishakapatnam           30
3        chennai           35

In [10]:
humidity_df=pd.DataFrame({
    "city":["hyderabad","mumbai","ap","chennai"],
    "humidity":[40,30,25,26]
})
humidity_df

        city  humidity
0  hyderabad        40
1     mumbai        30
2         ap        25
3    chennai        26

In [11]:
df=pd.merge(temp_df,humidity_df,on="city")
df

        city  Temperature  humidity
0  hyderabad           32        40
1    chennai           35        26

In [12]:
df=pd.merge(temp_df,humidity_df,on="city",how="outer")
df

            city  Temperature  humidity
0      hyderabad         32.0      40.0
1      bangalore         45.0       NaN
2  vishakapatnam         30.0       NaN
3        chennai         35.0      26.0
4         mumbai          NaN      30.0
5             ap          NaN      25.0

In [13]:
df.isnull() #to find the missing values

    city  Temperature  humidity
0  False        False     False
1  False        False      True
2  False        False      True
3  False        False     False
4  False         True     False
5  False         True     False

In [14]:
df.isnull().sum()

city           0
Temperature    2
humidity       2
dtype: int64

In [16]:
df['Temperature']=df['Temperature'].fillna(df.Temperature.min())
df['Temperature']

0    32.0
1    45.0
2    30.0
3    35.0
4    30.0
5    30.0
Name: Temperature, dtype: float64

In [17]:
df.isnull()

    city  Temperature  humidity
0  False        False     False
1  False        False      True
2  False        False      True
3  False        False     False
4  False        False     False
5  False        False     False

In [18]:
df['humidity']=df['humidity'].fillna(df.humidity.max())
df['humidity']

0    40.0
1    40.0
2    40.0
3    26.0
4    30.0
5    25.0
Name: humidity, dtype: float64

In [19]:
df.isnull()

    city  Temperature  humidity
0  False        False     False
1  False        False     False
2  False        False     False
3  False        False     False
4  False        False     False
5  False        False     False

In [20]:
df

            city  Temperature  humidity
0      hyderabad         32.0      40.0
1      bangalore         45.0      40.0
2  vishakapatnam         30.0      40.0
3        chennai         35.0      26.0
4         mumbai         30.0      30.0
5             ap         30.0      25.0